cmsis-svd/cmsis-svd/data/Atmel/ATSAM4S16C.svd
        <register>
          <name>OOV</name>
          <description>PWM Output Override Value Register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OOVH0</name>
              <description>Output Override Value for PWMH output of the channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OOVH1</name>
              <description>Output Override Value for PWMH output of the channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OOVH2</name>
              <description>Output Override Value for PWMH output of the channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OOVH3</name>
              <description>Output Override Value for PWMH output of the channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OOVL0</name>
              <description>Output Override Value for PWML output of the channel 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OOVL1</name>
              <description>Output Override Value for PWML output of the channel 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OOVL2</name>
              <description>Output Override Value for PWML output of the channel 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OOVL3</name>
              <description>Output Override Value for PWML output of the channel 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OS</name>
          <description>PWM Output Selection Register</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OSH0</name>
              <description>Output Selection for PWMH output of the channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSH1</name>
              <description>Output Selection for PWMH output of the channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSH2</name>
              <description>Output Selection for PWMH output of the channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSH3</name>
              <description>Output Selection for PWMH output of the channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSL0</name>
              <description>Output Selection for PWML output of the channel 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSL1</name>
              <description>Output Selection for PWML output of the channel 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSL2</name>
              <description>Output Selection for PWML output of the channel 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSL3</name>
              <description>Output Selection for PWML output of the channel 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSS</name>
          <description>PWM Output Selection Set Register</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OSSH0</name>
              <description>Output Selection Set for PWMH output of the channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSSH1</name>
              <description>Output Selection Set for PWMH output of the channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSSH2</name>
              <description>Output Selection Set for PWMH output of the channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSSH3</name>
              <description>Output Selection Set for PWMH output of the channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSSL0</name>
              <description>Output Selection Set for PWML output of the channel 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSSL1</name>
              <description>Output Selection Set for PWML output of the channel 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSSL2</name>
              <description>Output Selection Set for PWML output of the channel 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSSL3</name>
              <description>Output Selection Set for PWML output of the channel 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC</name>
          <description>PWM Output Selection Clear Register</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OSCH0</name>
              <description>Output Selection Clear for PWMH output of the channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSCH1</name>
              <description>Output Selection Clear for PWMH output of the channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSCH2</name>
              <description>Output Selection Clear for PWMH output of the channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSCH3</name>
              <description>Output Selection Clear for PWMH output of the channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSCL0</name>
              <description>Output Selection Clear for PWML output of the channel 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSCL1</name>
              <description>Output Selection Clear for PWML output of the channel 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSCL2</name>
              <description>Output Selection Clear for PWML output of the channel 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSCL3</name>
              <description>Output Selection Clear for PWML output of the channel 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSSUPD</name>
          <description>PWM Output Selection Set Update Register</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OSSUPH0</name>
              <description>Output Selection Set for PWMH output of the channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSSUPH1</name>
              <description>Output Selection Set for PWMH output of the channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSSUPH2</name>
              <description>Output Selection Set for PWMH output of the channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSSUPH3</name>
              <description>Output Selection Set for PWMH output of the channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSSUPL0</name>
              <description>Output Selection Set for PWML output of the channel 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSSUPL1</name>
              <description>Output Selection Set for PWML output of the channel 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSSUPL2</name>
              <description>Output Selection Set for PWML output of the channel 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSSUPL3</name>
              <description>Output Selection Set for PWML output of the channel 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCUPD</name>
          <description>PWM Output Selection Clear Update Register</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OSCUPH0</name>
              <description>Output Selection Clear for PWMH output of the channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSCUPH1</name>
              <description>Output Selection Clear for PWMH output of the channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSCUPH2</name>
              <description>Output Selection Clear for PWMH output of the channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSCUPH3</name>
              <description>Output Selection Clear for PWMH output of the channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSCUPL0</name>
              <description>Output Selection Clear for PWML output of the channel 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSCUPL1</name>
              <description>Output Selection Clear for PWML output of the channel 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSCUPL2</name>
              <description>Output Selection Clear for PWML output of the channel 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OSCUPL3</name>
              <description>Output Selection Clear for PWML output of the channel 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FMR</name>
          <description>PWM Fault Mode Register</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FPOL</name>
              <description>Fault Polarity (fault input bit varies from 0 to 5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMOD</name>
              <description>Fault Activation Mode (fault input bit varies from 0 to 5)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FFIL</name>
              <description>Fault Filtering (fault input bit varies from 0 to 5)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSR</name>
          <description>PWM Fault Status Register</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FIV</name>
              <description>Fault Input Value (fault input bit varies from 0 to 5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FS</name>
              <description>Fault Status (fault input bit varies from 0 to 5)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <description>PWM Fault Clear Register</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>FCLR</name>
              <description>Fault Clear (fault input bit varies from 0 to 5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPV</name>
          <description>PWM Fault Protection Value Register</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FPVH0</name>
              <description>Fault Protection Value for PWMH output on channel 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPVH1</name>
              <description>Fault Protection Value for PWMH output on channel 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPVH2</name>
              <description>Fault Protection Value for PWMH output on channel 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPVH3</name>
              <description>Fault Protection Value for PWMH output on channel 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPVL0</name>
              <description>Fault Protection Value for PWML output on channel 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPVL1</name>
              <description>Fault Protection Value for PWML output on channel 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPVL2</name>
              <description>Fault Protection Value for PWML output on channel 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPVL3</name>
              <description>Fault Protection Value for PWML output on channel 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPE</name>
          <description>PWM Fault Protection Enable Register</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FPE0</name>
              <description>Fault Protection Enable for channel 0 (fault input bit varies from 0 to 5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPE1</name>
              <description>Fault Protection Enable for channel 1 (fault input bit varies from 0 to 5)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPE2</name>
              <description>Fault Protection Enable for channel 2 (fault input bit varies from 0 to 5)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPE3</name>
              <description>Fault Protection Enable for channel 3 (fault input bit varies from 0 to 5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
