cmsis-svd/cmsis-svd/data/Atmel/ATSAM4S16C.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <version>6080C</version>
      <description>Watchdog Timer</description>
      <groupName>SYSC</groupName>
      <prependToName>WDT_</prependToName>
      <baseAddress>0x400E1450</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>WDRSTT</name>
              <description>Watchdog Restart</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>KEY</name>
              <description>Password</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FFF2FFF</resetValue>
          <fields>
            <field>
              <name>WDV</name>
              <description>Watchdog Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDFIEN</name>
              <description>Watchdog Fault Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDRSTEN</name>
              <description>Watchdog Reset Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDRPROC</name>
              <description>Watchdog Reset Processor</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDDIS</name>
              <description>Watchdog Disable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDD</name>
              <description>Watchdog Delta Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDDBGHLT</name>
              <description>Watchdog Debug Halt</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDIDLEHLT</name>
              <description>Watchdog Idle Halt</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WDUNF</name>
              <description>Watchdog Underflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDERR</name>
              <description>Watchdog Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <version>6056L</version>
      <description>Real-time Clock</description>
      <groupName>SYSC</groupName>
      <prependToName>RTC_</prependToName>
      <baseAddress>0x400E1460</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UPDTIM</name>
              <description>Update Request Time Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDCAL</name>
              <description>Update Request Calendar Register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEVSEL</name>
              <description>Time Event Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINUTE</name>
                  <description>Minute change</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOUR</name>
                  <description>Hour change</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIDNIGHT</name>
                  <description>Every day at midnight</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOON</name>
                  <description>Every day at noon</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALEVSEL</name>
              <description>Calendar Event Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WEEK</name>
                  <description>Week change (every Monday at time 00:00:00)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONTH</name>
                  <description>Month change (every 01 of each month at time 00:00:00)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YEAR</name>
                  <description>Year change (every January 1 at time 00:00:00)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HRMOD</name>
              <description>12-/24-hour Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERSIAN</name>
              <description>PERSIAN Calendar</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEGPPM</name>
              <description>NEGative PPM Correction</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORRECTION</name>
              <description>Slow Clock Correction</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIGHPPM</name>
              <description>HIGH PPM Correction</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT0</name>
              <description>RTCOUT0 Output Source Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_WAVE</name>
                  <description>no waveform, stuck at '0'</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ1HZ</name>
                  <description>1 Hz square wave</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ32HZ</name>
                  <description>32 Hz square wave</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ64HZ</name>
                  <description>64 Hz square wave</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ512HZ</name>
                  <description>512 Hz square wave</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALARM_TOGGLE</name>
                  <description>output toggles when alarm flag rises</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALARM_FLAG</name>
                  <description>output is a copy of the alarm flag</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_PULSE</name>
                  <description>duty cycle programmable pulse</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT1</name>
              <description>RTCOUT1 Output Source Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_WAVE</name>
                  <description>no waveform, stuck at '0'</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ1HZ</name>
                  <description>1 Hz square wave</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ32HZ</name>
                  <description>32 Hz square wave</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ64HZ</name>
                  <description>64 Hz square wave</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ512HZ</name>
                  <description>512 Hz square wave</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALARM_TOGGLE</name>
                  <description>output toggles when alarm flag rises</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALARM_FLAG</name>
                  <description>output is a copy of the alarm flag</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_PULSE</name>
                  <description>duty cycle programmable pulse</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THIGH</name>
              <description>High Duration of the Output Pulse</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>H_31MS</name>
                  <description>31.2 ms</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H_16MS</name>
                  <description>15.6 ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H_4MS</name>
                  <description>3.91 Lms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H_976US</name>
                  <description>976 us</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H_488US</name>
                  <description>488 us</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H_122US</name>
                  <description>122 us</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H_30US</name>
                  <description>30.5 us</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>H_15US</name>
                  <description>15.2 us</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPERIOD</name>
              <description>Period of the Output Pulse</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P_1S</name>
                  <description>1 second</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P_500MS</name>
                  <description>500 ms</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P_250MS</name>
                  <description>250 ms</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P_125MS</name>
                  <description>125 ms</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMR</name>
          <description>Time Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEC</name>
              <description>Current Second</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIN</name>
              <description>Current Minute</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOUR</name>
              <description>Current Hour</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMPM</name>
              <description>Ante Meridiem Post Meridiem Indicator</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALR</name>
          <description>Calendar Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01A11020</resetValue>
          <fields>
            <field>
              <name>CENT</name>
              <description>Current Century</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YEAR</name>
              <description>Current Year</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MONTH</name>
              <description>Current Month</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAY</name>
              <description>Current Day in Current Week</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATE</name>
              <description>Current Day in Current Month</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMALR</name>
          <description>Time Alarm Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEC</name>
              <description>Second Alarm</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECEN</name>
              <description>Second Alarm Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIN</name>
              <description>Minute Alarm</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MINEN</name>
              <description>Minute Alarm Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOUR</name>
              <description>Hour Alarm</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMPM</name>
              <description>AM/PM Indicator</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOUREN</name>
              <description>Hour Alarm Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALALR</name>
          <description>Calendar Alarm Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01010000</resetValue>
          <fields>
            <field>
              <name>MONTH</name>
              <description>Month Alarm</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MTHEN</name>
              <description>Month Alarm Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATE</name>
              <description>Date Alarm</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATEEN</name>
              <description>Date Alarm Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
